{
    "id": "13336788",
    "examiner_id": "98534.0",
    "topic_id": "",
    "examiner_namer": "ZHENGFU  FENG",
    "inventor_list": [
        {
            "inventor_name_last": "CHAN",
            "inventor_name_first": "Chien-Ting",
            "inventor_city": "Tainan City",
            "inventor_state": "",
            "inventor_country": "TW"
        },
        {
            "inventor_name_last": "LEE",
            "inventor_name_first": "Kuo-Sheng",
            "inventor_city": "Tainan City",
            "inventor_state": "",
            "inventor_country": "TW"
        },
        {
            "inventor_name_last": "CHAO",
            "inventor_name_first": "Yuan-Te",
            "inventor_city": "Pingtung County",
            "inventor_state": "",
            "inventor_country": "TW"
        },
        {
            "inventor_name_last": "TSENG",
            "inventor_name_first": "Chien-Hsiang",
            "inventor_city": "Taoyuan County",
            "inventor_state": "",
            "inventor_country": "TW"
        },
        {
            "inventor_name_last": "SHIH",
            "inventor_name_first": "Wei-Tong",
            "inventor_city": "Changhua County",
            "inventor_state": "",
            "inventor_country": "TW"
        },
        {
            "inventor_name_last": "WANG",
            "inventor_name_first": "I-Lang",
            "inventor_city": "Kaohsiung County",
            "inventor_state": "",
            "inventor_country": "TW"
        }
    ],
    "filing_date": "20111223",
    "title": "TOUCH PANEL AND METHOD FOR MANUFACTURING THE SAME",
    "abstract": "A touch panel and a method for manufacturing the same are disclosed. The touch panel includes a display module, a touch panel module and a first castor oil layer. In this touch panel, the display module connects to the touch panel module by a first adhesive layer. There is a first sealing space existed between the display module and the touch panel module. The first castor oil layer is set in the first sealing space. In this way, the purposes of being reproduced easily and saving costs can be achieved.",
    "summary": "<SOH> SUMMARY OF THE INVENTION <EOH>In view of the shortcomings of the prior art, the inventor(s) of the present invention based on years of experience in the related industry to conduct extensive researches and experiments, and finally developed a touch panel and the method for manufacturing the same and overcame problems that the touch panel is high cost and not reworkable. To achieve the foregoing objective, the touch panel according to the invention comprises a display module, a touch module and a first castor oil layer, wherein the touch module is connected to the touch module through a first adhesive layer, and a first sealing space is formed between the display module and the touch module. The first sealing space is used for containing the first castor oil layer. For example, the first adhesive layer is in frame-shape. The adhesion position is located between the display module and the touch module and at the border of the display module and the touch module. The first adhesive layer can provide a sufficient thickness so that aforementioned capacitor effect will not take place. Therefore, when the display module is connected to the touch module through the first adhesive layer, the frame-shape first sealing space for containing the first castor oil layer is produced. In addition, the touch module comprises a touch substrate and a cover glass. The touch module can be connected to the cover glass through LOCA or a second adhesive layer. A second sealing space is formed between the touch substrate and the cover glass. The second sealing space is used for containing a second castor oil layer. The invention further provides a method for manufacturing a touch panel comprising the following steps: providing a display module; connecting a touch module and the display module through a first adhesive layer, wherein a first sealing space is formed between the display module and the touch module; and providing a first castor oil layer in the first sealing space. It should be noted that the shape of the first adhesive layer can be in frame-shape. Its adhesion position is located between the display module and the touch module and at the border of the display module and the touch module. The effect has been depicted in the foregoing paragraph, and there is no need to describe herein. In addition, the touch module comprises a touch substrate and a cover glass. The touch module can be connected to the cover glass through LOCA or a second adhesive layer. A second sealing space is formed between the touch substrate and the cover glass. The second sealing space is used for containing a second castor oil layer. The touch panel and its manufacturing method according to the present invention not only can avoid poor touch sensing accuracy due to the capacitor effect, but also can reduce costs. In addition, since the first adhesive layer and the second adhesive layer are adhered in the outer portion of the touch panel, the touch panel according to the present invention is reworkable.",
    "claims": "1. A touch panel comprising: a display module; a touch module, wherein the display module is connected to the touch module through a first adhesive layer, and a first sealing space is formed between the display module and the touch module; and a first castor oil layer, wherein the first castor oil layer is located in the first sealing space. 2. The touch panel as recited in claim 1, wherein a shape of the first adhesive layer is in frame-shape. 3. The touch panel as recited in claim 1, wherein the touch module comprises a touch substrate and a cover glass, and the touch substrate is connected to the cover glass through a liquid optical clear adhesive. 4. The touch panel as recited in claim 1, wherein the touch module further comprises a touch substrate and a cover glass, and the touch substrate is connected to the cover glass through a second adhesive layer, and a second sealing space is formed between the touch substrate and the cover glass. 5. The touch panel as recited in claim 4, further comprising a second castor oil layer in the second sealing space. 6. A method for manufacturing a touch panel comprising: providing a display module; providing a touch module, wherein the display module is connected to the touch module through a first adhesive layer, and a first sealing space is formed between the display module and the touch module; and providing a first castor oil layer, wherein the first castor oil layer is located in the first sealing space. 7. The method for manufacturing a touch panel as recited in claim 6, wherein a shape of the first adhesive layer is in frame-shape. 8. The method for manufacturing a touch panel as recited in claim 6, wherein the touch module comprises a touch substrate and a cover glass, and the touch substrate is connected to the cover glass through a liquid optical clear adhesive. 9. The method for manufacturing a touch panel as recited in claim 6, wherein the touch module further comprises a touch substrate and a cover glass, and the touch substrate is connected to the cover glass through a second adhesive layer, and a second sealing space is formed between the touch substrate and the cover glass. 10. The method for manufacturing a touch panel as recited in claim 9, further comprising the following step: providing a second castor oil layer in the second sealing space.",
    "background": "<SOH> BACKGROUND OF THE INVENTION <EOH>1. Field of the Invention The present invention relates to a touch panel, and more particularly to a touch panel having a castor oil layer. 2. Description of the Related Art Recently, a capacitive touch panel has been widely applied to different types of electronic products. For example, the capacitive touch panel can be applied to a mouse pad of a notebook computer or can be disposed on screens of small electronic products such as a mobile phone, a personal digital assistant, a global positioning system. However, a display module is adhered to a touch module by using optical clear adhesive (OCA) during the production of the capacitive touch panel, wherein the greatest difficulty is that high defective rate resulting form bubble cannot be avoided when OCA is used to perform lamination. In addition, OCA is not reworkable. Consequently, the defective products must be scrapped. Moreover, when the medium or large-size touch panels begin to be produced, the yield thereof will be more difficult to be enhanced. Therefore, reworkable liquid optical clear adhesive (LOCA) is introduced to perform lamination between the display module and the touch module. However, high yield still cannot be achieved by the technique. In addition, while OCA or LOCA is used to perform lamination, insufficient thickness of OCA and LOCA will result in capacitor effect between the routing of the touch module and the metal frame of the display module, such that touch sensing signals may be interfered and result in poor sensing accuracy. If the thickness of OCA or LOCA is increased, costs are also raised.",
    "decision": "REJECTED"
}